# Динамическая типизация
#
# Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
#
# В проекте, где вы решаете домашние задания, создайте модуль 'module_1_1.py' и напишите весь код в нём.
#
# 2. Создайте переменные разных типов данных:
# - Создайте переменную name и присвойте ей значение вашего имени (строка).
#  - Выведите значение переменной name на экран.
#  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#  - Выведите значение переменной age на экран.
#  - Перезапишите в age текущее значение переменной age + новое.
# Как неверно (просто перезапись на новое число):
# a = 15
# a = 17
#  - Выведите измененное значение переменной age на экран.
#  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#  - Выведите значение переменной is_student на экран.

name = "Oleg"
print(f'Name: {name}')
age = 44
print(f'Age: {age}')
new_age = 18
print(f'New age: {age-new_age}')
is_Student = True
print(f'Is Student: {is_Student}')